AUTO_config_TK_pesok/src/Documents/ИзменениеАссортимента/ИзменениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеАссортимента</name>
  <registerRecords>InformationRegister.ОграничениеАссортимента</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВАссортимент</name>
    <comment>Дата ввода товар в ассортимент</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ИзменениеАссортимента</types>
      <types>DocumentRef.АссортиментныйКомитет</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйАссортимент</name>
      <comment>Товар вводится в базовый ассортимет</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАссортимента</name>
      <type>
        <types>CatalogRef.ВидыАссортимента</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеПлощадки</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетнаяПолитикаТорговыхПлощадок/ТК_УчетнаяПолитикаТорговыхПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетнаяПолитикаТорговыхПлощадок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ОграничениеАссортимента/ОграничениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграничениеАссортимента</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <comment>0-не введено, 1-введено, 2-РаспродажаСПоследующимВыводом</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидАссортимента</name>
    <type>
      <types>CatalogRef.ВидыАссортимента</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/ИзменениеАссортимента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПриЧтенииСозданииНаСервере();
	//КонецЕсли;
	//
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьДеревоТорговыхПолощадок();
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ИзменениеАссортимента"));
	
	Элементы.ГруппаОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	// Запрещено редактировать документ введенный на основании "АссортиментныйКомитет"
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.АссортиментныйКомитет") Тогда 
		ЭтаФорма.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьДеревоТПВОбъект();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	ЗаполнитьДеревоТорговыхПолощадок();
КонецПроцедуры


#КонецОбласти


#Область СобытиеТабличнойЧастиТорговыеПлощадки

&НаКлиенте
Процедура ВыбранныеТорговыеПлощадкиВыбранаПриИзменении(Элемент)
	
	ИДТекущейСтроки =  Элементы.ВыбранныеТорговыеПлощадки.ТекущаяСтрока;
	Если ИДТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	
	ЭлементКоллекции = ЭтаФорма.ВыбранныеТорговыеПлощадки.НайтиПоИдентификатору(ИДТекущейСтроки);
	
	ЗначениеФлажка = ЭлементКоллекции.Выбрана;
	УстановкаФлажков(ЭлементКоллекции,ЗначениеФлажка);
	
	//ПодключитьОбработчикОжидания("ЗаписатьДеревоТПВОбъект", 0.3, Истина);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьДеревоТПВОбъект()
	
	Объект.ТорговыеПлощадки.Очистить();
	
	Для Каждого Стр Из ВыбранныеТорговыеПлощадки.ПолучитьЭлементы() Цикл 
		ЗаписатьСтрокуДерева(Объект, Стр);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции,ЗначениеФлажка)
	//ЭтоУр3 = Ложь;
	//Если ЭлементКоллекции.ПолучитьРодителя() = Неопределено Тогда
	//	Ур1 = ЭлементКоллекции;
	//ИначеЕсли ЭлементКоллекции.ПолучитьРодителя().ПолучитьРодителя() = Неопределено Тогда
	//	Ур1 = ЭлементКоллекции.ПолучитьРодителя();
	//Иначе
	//	ЭтоУр3 = Истина;
	//	Ур1 = ЭлементКоллекции.ПолучитьРодителя().ПолучитьРодителя();
	//КонецЕсли;
	//Матрица = Ур1.ТорговаяПлощадка;
	//нп = СтрНайти(Матрица,"(",НаправлениеПоиска.СКонца);
	//кп = СтрНайти(Матрица," из",НаправлениеПоиска.СКонца);
	//КолВоОтмеченных = 0;
	////КолВоОтмеченных = Сред(Матрица,нп+1,кп-нп-1);
	//КолВоВсего = Сред(Матрица,кп+4,СтрДлина(Матрица)-кп-4);
	//Если ЭтоУр3 Тогда
	//	КолВоОтмеченных = Сред(Матрица,нп+1,кп-нп-1);
	//	Если ЗначениеФлажка Тогда
	//		КолВоОтмеченных = Число(КолВоОтмеченных)+1;
	//	Иначе
	//		КолВоОтмеченных = Число(КолВоОтмеченных)-1;
	//	КонецЕсли;
	//КонецЕсли;
	//Ур1.ТорговаяПлощадка = Лев(Матрица,нп-1)+"("+КолВоОтмеченных+" из "+КолВоВсего+")";
	ПодчинЭлементы = ЭлементКоллекции.ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
		ТекЭлемент.Выбрана = ЗначениеФлажка;
		
		УстановкаФлажков(ТекЭлемент, ЗначениеФлажка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоТорговыхПолощадок()
	ДеревоТорговыхПлощадок = РеквизитФормыВЗначение("ВыбранныеТорговыеПлощадки");
	ДеревоТорговыхПлощадок.Строки.Очистить();
	
	СоответствиеПлощадок = Новый Соответствие;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002"),Справочники.ТорговыеПлощадки.НайтиПоКоду("ХGL000110"));	//	ТС АТТИКА
	Исключение
	КонецПопытки;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000009"),Справочники.ТорговыеПлощадки.НайтиПоКоду("ХGL000285"));		//	ТС Табакко
	Исключение
	КонецПопытки;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008"),Справочники.ТорговыеПлощадки.НайтиПоКоду("YY000118"));		//	ТС Buffet
	Исключение
	КонецПопытки;
	
	ГруппаПлощадок = СоответствиеПлощадок.Получить(Объект.ПодразделениеКомпании);
	
	Если ЗначениеЗаполнено(ГруппаПлощадок) Тогда
		//УстановитьПривилегированныйРежим(Истина);
		Элементы.ВыбранныеТорговыеПлощадки.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СкладыКомпании.АссортиментнаяМатрица, """") КАК Матрица,
		|	ЕСТЬNULL(ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
		|	ТорговыеПлощадки.Ссылка КАК ТорговаяПлощадка,
		|	СкладыКомпании.Ссылка КАК Склад,
		|	ВЫБОР
		|		КОГДА ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Выбрана,
		|	ВЫБОР
		|		КОГДА ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Выбранных,
		|	ТорговыеПлощадки.Ссылка КАК Количество
		|ИЗ
		|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента.ТорговыеПлощадки КАК ИзменениеАссортиментаТорговыеПлощадки
		|		ПО (ИзменениеАссортиментаТорговыеПлощадки.Ссылка = &Ссылка)
		|			И ТорговыеПлощадки.Ссылка = ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК СкладыКомпании
		|		ПО ТорговыеПлощадки.Ссылка = СкладыКомпании.ТорговаяПлощадка
		|			И (СкладыКомпании.АссортиментнаяМатрица <> ЗНАЧЕНИЕ(Справочник.АссортиментнаяМатрица.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
		|		ПО ТорговыеПлощадки.Ссылка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
		|ГДЕ
		|	ТорговыеПлощадки.Ссылка В ИЕРАРХИИ(&Площадка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Матрица УБЫВ,
		|	Организация,
		|	Склад,
		|	ТорговаяПлощадка
		|ИТОГИ
		|	СУММА(Выбранных),
		|	КОЛИЧЕСТВО(Количество)
		|ПО
		|	Матрица,
		|	Организация
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("Площадка", ГруппаПлощадок);
		
		РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
		
		ВыборкаМатрица = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМатрица.Следующий() Цикл
			Выбрана =  ВыборкаМатрица.Выбранных > 0;
			КолВоКиосковМатрицы = 0;
			стрМатрица = ДеревоТорговыхПлощадок.Строки.Добавить();
			стрМатрица.Выбрана = Выбрана;
			ВыборкаОрганизация = ВыборкаМатрица.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОрганизация.Следующий() Цикл
				Выбрана =  ВыборкаОрганизация.Выбранных > 0;
				стрОрганизация = стрМатрица.Строки.Добавить();
				стрОрганизация.Выбрана = Выбрана;
				стрОрганизация.ТорговаяПлощадка = ВыборкаОрганизация.Организация;
				ВыборкаСклад = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				Пока ВыборкаСклад.Следующий()Цикл 
					стрСклад = стрОрганизация.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(стрСклад,ВыборкаСклад);
					КолВоКиосковМатрицы = КолВоКиосковМатрицы + 1;
				КонецЦикла;
				стрОрганизация.ТорговаяПлощадка = ВыборкаОрганизация.Организация.Наименование + " ("+ВыборкаОрганизация.Выбранных+" из "+ВыборкаОрганизация.Количество+")";
			КонецЦикла;
			стрМатрица.ТорговаяПлощадка = ?(ВыборкаМатрица.Матрица="","ПустаЯ",ВыборкаМатрица.Матрица.Наименование) + " ("+ВыборкаМатрица.Выбранных+" из "+КолВоКиосковМатрицы+")";
		КонецЦикла;
		
		//УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТорговыеПлощадки.Ссылка КАК ТорговаяПлощадка,
		|	ТорговыеПлощадки.Родитель КАК Родитель,
		|	ВЫБОР
		|		КОГДА ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Выбрана
		|ИЗ
		|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента.ТорговыеПлощадки КАК ИзменениеАссортиментаТорговыеПлощадки
		|		ПО (ИзменениеАссортиментаТорговыеПлощадки.Ссылка = &Ссылка)
		|			И ТорговыеПлощадки.Ссылка = ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка
		//|			И ТорговыеПлощадки.ПодразделениеКомпании = ИзменениеАссортиментаТорговыеПлощадки.Ссылка.ПодразделениеКомпании
		|
		|СГРУППИРОВАТЬ ПО
		|	ТорговыеПлощадки.Ссылка,
		|	ВЫБОР
		|		КОГДА ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	ТорговыеПлощадки.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговаяПлощадка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
		Выборка = РезультатЗапроса.Выбрать();
		
		СоответствиеРодителей = Новый Соответствие();
		
		// добавляем строки в дерево. Иерархически.
		Пока Выборка.Следующий() Цикл
			//
			Если СоответствиеРодителей[Выборка.Родитель]=Неопределено Тогда
				ТекСтрока = ДеревоТорговыхПлощадок.Строки.Добавить();
			Иначе
				ТекСтрока = СоответствиеРодителей[Выборка.Родитель].Строки.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТекСтрока,Выборка);
			СоответствиеРодителей.Вставить(Выборка.ТорговаяПлощадка, ТекСтрока);
			// флаг использования
			//ТекСтрока.Выбрана = Выборка.Выбрана;
			
		КонецЦикла;
	КонецЕсли;
	
	//Если ссылки ещё нет - установим галочки по ТЧ подразделений 
	Если Параметры.Ключ.Пустая() Тогда
		Для Каждого стчТП Из Объект.ТорговыеПлощадки Цикл
			НайденнаяСтрока = ДеревоТорговыхПлощадок.Строки.Найти(стчТП.ТорговаяПлощадка, "ТорговаяПлощадка", Истина);
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденнаяСтрока.Выбрана = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	ЗначениеВРеквизитФормы(ДеревоТорговыхПлощадок,"ВыбранныеТорговыеПлощадки");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтрокуДерева(ТекущийОбъект,СтрокаДерева)
	
	// проверим, а надо ли записывать
	Если ТипЗнч(СтрокаДерева.ТорговаяПлощадка) = Тип("СправочникСсылка.ТорговыеПлощадки") Тогда 
		Если ЗначениеЗаполнено(СтрокаДерева.ТорговаяПлощадка) И СтрокаДерева.Выбрана Тогда
			НоваяЗапись = ТекущийОбъект.ТорговыеПлощадки.Добавить();
			НоваяЗапись.ТорговаяПлощадка = СтрокаДерева.ТорговаяПлощадка;
		КонецЕсли;
	КонецЕсли;
	
	// подчиненные строки
	Для Каждого СтрокаДереваПодч Из СтрокаДерева.ПолучитьЭлементы() Цикл 
		ЗаписатьСтрокуДерева(ТекущийОбъект, СтрокаДереваПодч);
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Данные) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Данные.Команда = "УстановитьТекущийДляВсех" Тогда
			УстановитьТекущееДляВсех(Данные);
			Возврат;
		Иначе
			Объект[Данные.ТЧ].Очистить();
			Модифицированность=Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.Команда = "КомандаЗаполнитьПоСпискуАртикулов" Тогда
		ЗаполнитьПоСписку(Данные);
	ИначеЕсли Данные.Команда = "КомандаЗаполнитьПоАссортиментуТочки" Тогда
		ВыбратьСкладАссортимента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСписку(Данные)
	Подсказка = "Введите новый код с новой строки";
	Строка = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводСтроки", ЭтаФорма,Данные);
	ПоказатьВводСтроки(ОписаниеОповещения, Строка, Подсказка,,Истина);
КонецПроцедуры

&НаСервере
Процедура ВводСтроки(ПолученноеЗначение, ПереданныеПараметры) Экспорт
	
	Если ПереданныеПараметры.Справочник = "Номенклатура" Тогда	
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",зн);
			Если Элем = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
				Сообщить("Номенклатура не найдена, артикул: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа номенклатуры '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			
			Если Объект[ПереданныеПараметры.ТЧ].НайтиСтроки(Новый Структура(ПереданныеПараметры.Справочник,Элем)).Количество() = 0 Тогда
				СтрокаТЧ = Объект[ПереданныеПараметры.ТЧ].Добавить();
				СтрокаТЧ.Номенклатура = Элем;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПереданныеПараметры.Справочник = "СкладыКомпании" Тогда
		ДеревоПлощадок = РеквизитФормыВЗначение("ВыбранныеТорговыеПлощадки");
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.СкладыКомпании.НайтиПоКоду(зн);
			Если Элем = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
				Сообщить("Склад не найден, код: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа склада '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			Если Элем.ТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка") Тогда
				Сообщить("Торговая площадка не заполнена у склада: " +Элем);
				Продолжить;
			КонецЕсли;
			
			мСтрок = ДеревоПлощадок.Строки.НайтиСтроки(Новый Структура("ТорговаяПлощадка",Элем.ТорговаяПлощадка),Истина);
			Для Каждого строкаСклад Из мСтрок Цикл
				строкаСклад.Выбрана = Истина;
			КонецЦикла;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоПлощадок,"ВыбранныеТорговыеПлощадки");
		Модифицированность = Истина;
		
	ИначеЕсли ПереданныеПараметры.Справочник = "ТорговаяПлощадка" Тогда
		СписокПлощадок = Новый СписокЗначений;
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.СкладыКомпании.НайтиПоКоду(зн);
			Если Элем = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
				Сообщить("Склад не найден, код: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа склада '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			Если Элем.ТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка") Тогда
				Сообщить("Торговая площадка не заполнена у склада: " +Элем);
				Продолжить;
			КонецЕсли;
			
			Если СписокПлощадок.НайтиПоЗначению(Элем.ТорговаяПлощадка) = Неопределено Тогда
				СписокПлощадок.Добавить(Элем.ТорговаяПлощадка);
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьПоАссортиментуТочки(СписокПлощадок,СписокПлощадок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСкладАссортимента()
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора", ПараметрыПодбора,,,,,Новый ОписаниеОповещения("ЗаполнитьПоАссортиментуТочки",ЭтотОбъект,),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоАссортиментуТочкиНаСервере(Склад)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда 
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Склад.ТорговаяПлощадка) Тогда
		Сообщить("У выбранного склада не заполнена Торговая площадка!!!");
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОграничениеАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
	|	ОграничениеАссортиментаСрезПоследних.БазовыйАссортимент КАК БазовыйАссортимент,
	|	ОграничениеАссортиментаСрезПоследних.ВидАссортимента КАК ВидАссортимента
	|ИЗ
	|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(&НаДату, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ОграничениеАссортиментаСрезПоследних
	|ГДЕ
	|	ОграничениеАссортиментаСрезПоследних.Состояние = 1";
	
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", Склад.ТорговаяПлощадка);
	
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоАссортиментуТочки(Склад,Параметр) Экспорт
	Если НЕ ЗначениеЗаполнено(Склад) Тогда 
		Возврат;
	ИначеЕсли ТипЗнч(Склад) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		Если ЗначениеЗаполнено(Склад.ТорговаяПлощадка) Тогда
			ТорговаяПлощадка = Склад.ТорговаяПлощадка;
		Иначе
			Сообщить("У выбранного склада не заполнена Торговая площадка!!!");
			Возврат;
		КонецЕсли;
	Иначе
		ТорговаяПлощадка = Склад;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОграничениеАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ОграничениеАссортиментаСрезПоследних.БазовыйАссортимент) КАК БазовыйАссортимент,
	|	МАКСИМУМ(ОграничениеАссортиментаСрезПоследних.ВидАссортимента) КАК ВидАссортимента
	|ИЗ
	|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(&НаДату, ТорговаяПлощадка В (&ТорговаяПлощадка)) КАК ОграничениеАссортиментаСрезПоследних
	|ГДЕ
	|	ОграничениеАссортиментаСрезПоследних.Состояние = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ОграничениеАссортиментаСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущееДляВсех(Данные) Экспорт
	ТекущаяСтрока=Элементы.Товары.ТекущиеДанные;
	ТекущееЗначение=ТекущаяСтрока[Данные.ИмяКолонки];
	Для Каждого СтрокаТЧ ИЗ Объект.Товары Цикл
		СтрокаТЧ[Данные.ИмяКолонки]=ТекущееЗначение;
	КонецЦикла;
	Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Элемент.ТекстРедактирования, 
	ЭтотОбъект, 
	"Объект.Комментарий");
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистить(Команда)
	Если Элементы.ГруппаТабличныеЧасти.ТекущаяСтраница.Имя = "ГруппаТовары" Тогда
		Объект.Товары.Очистить();
	ИначеЕсли Элементы.ГруппаТабличныеЧасти.ТекущаяСтраница.Имя = "ГруппаТорговыеПлощадки" Тогда
		УстановкаФлажков(ВыбранныеТорговыеПлощадки, Ложь);
		//Объект.ТорговыеПлощадки.Очистить();
		//ЗаполнитьДеревоТорговыхПолощадок()
	КонецЕсли;
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоСпискуАртикулов(Команда)
	Данные = Новый Структура ("Команда,ТЧ,Справочник",Команда.Имя,"Товары","Номенклатура");
	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Данные);
		
		ПоказатьВопрос (Оповещение,"Очистить табличную часть?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьПоСписку(Данные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоАссортиментуТочки(Команда)
	Данные = Новый Структура ("Команда,ТЧ,Справочник",Команда.Имя,"Товары","ТорговаяПлощадка");
	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Данные);
		
		ПоказатьВопрос (Оповещение,"Табличная часть будет очищена!",РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.ОК);
	Иначе
		ЗаполнитьПоСписку(Данные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьТочки(Команда)
	Данные = Новый Структура ("Команда,ТЧ,Справочник",Команда.Имя,"ТорговыеПлощадки","СкладыКомпании");
	ЗаполнитьПоСписку(Данные);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьДеревоТорговыхПолощадок(Команда)
	ЗаполнитьДеревоТорговыхПолощадок();
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийДляВсехНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийДляВсех(Команда)
	ИмяКолонки=Элементы.Товары.ТекущийЭлемент.Имя;
	Если ИмяКолонки="ТоварыБазовыйАссортимент"
		ИЛИ ИмяКолонки="ТоварыВидАссортимента" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Новый Структура ("Команда,ИмяКолонки","УстановитьТекущийДляВсех",Прав(ИмяКолонки,СтрДлина(ИмяКолонки)-СтрДлина("Товары"))));
		ПоказатьВопрос (Оповещение,"Установить текущее значение всем элементам таблицы?"+Символы.ПС+"Данная операция необратима для всего документа!",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	Иначе
		ПоказатьПредупреждение(,"Для текущей колонки данная функция не доступна !!!");
		Возврат;
	КонецЕсли;
КонецПроцедуры




#КонецОбласти
